# Pandas Masterclass: A Comprehensive Review

This notebook is a consolidated guide to the key Pandas concepts covered in notebooks `DS_Pandas_03`, `DS_Pandas_04`, `DSP`, and `DS_Pandas_06`. It's designed to get you up to speed with clear, easy-to-follow examples.

**Learning Path:**
1.  **DataFrame Fundamentals**: Creating and indexing DataFrames.
2.  **Data Inspection & Basic Analysis**: Getting to know your data.
3.  **Grouping & Aggregating**: Summarizing data to find insights.
4.  **Time Series & String Manipulation**: Working with dates and text.

## Setup
First, let's import the pandas library.

In [3]:
import pandas as pd
import datetime

## Part 1: DataFrame Fundamentals & Indexing

This section covers how to select and retrieve data from a DataFrame. We'll start with the basics and then move to the powerful `.loc` and `.iloc` accessors.

In [4]:
# Create a simple DataFrame to work with
df = pd.DataFrame({
    'Name':['Uwaish', 'Husain', 'Khan', 'Salman'],
    'Age':[22, 23, 24, 25],
    'Gender':['M', 'M', 'F', 'M'],
    'Role': ['Admin', 'Editor', 'Viewer', 'Editor']
})

print("Initial DataFrame:")
df

Initial DataFrame:

     Name  Age Gender    Role
0  Uwaish   22      M   Admin
1  Husain   23      M  Editor
2    Khan   24      F  Viewer
3  Salman   25      M  Editor

### Basic Selection

While you can't select a single row with `df[0]` (which would raise a `KeyError`), you can select columns and slice rows.

In [7]:
# Select a single column (returns a Series)
print("Selecting the 'Name' column:")
display(df[['Name']])

Selecting the 'Name' column:

     Name
0  Uwaish
1  Husain
2    Khan
3  Salman

In [8]:
# Select multiple columns (returns a DataFrame)
print("\nSelecting 'Name' and 'Role' columns:")
display(df[['Name', 'Role']])

Selecting 'Name' and 'Role' columns:

     Name    Role
0  Uwaish   Admin
1  Husain  Editor
2    Khan  Viewer
3  Salman  Editor

In [9]:
# Slice the first two rows
print("\nSlicing the first 2 rows:")
display(df[0:2])

Slicing the first 2 rows:

     Name  Age Gender    Role
0  Uwaish   22      M   Admin
1  Husain   23      M  Editor

---
### The Power of `.loc` and `.iloc`

For more precise selections, Pandas provides two main accessors: `.iloc` and `.loc`. Understanding the difference is crucial.

| Accessor | Selection Method      | Description                                      |
|----------|-----------------------|--------------------------------------------------|
| `.iloc`  | Integer-Position Based| Selects data based on its zero-indexed position.   |
| `.loc`   | Label-Based           | Selects data based on the index label or name.   |

---

```mermaid
graph TD
    A[Start Selection] --> B{Want to select by...}
    B --> C[Integer Position 0 1 2 etc]
    B --> D[Index Label Uwaish A etc]
    C --> E[Use .iloc]
    D --> F[Use .loc]
```

#### Using `.iloc` (Integer-based selection)

In [42]:
# Select the first row (index 0)
print("First row:")
display(df.iloc[[0]])

First row:

     Name  Age Gender   Role
0  Uwaish   22      M  Admin

In [8]:
# Select the first two rows (indices 0 and 1)
print("\nFirst two rows:")
display(df.iloc[0:2])

First two rows:

     Name  Age Gender    Role
0  Uwaish   22      M   Admin
1  Husain   23      M  Editor

In [9]:
# Select all rows, but only the first two columns (indices 0 and 1)
print("\nAll rows, first two columns:")
display(df.iloc[:, 0:2])

All rows, first two columns:

     Name  Age
0  Uwaish   22
1  Husain   23
2    Khan   24
3  Salman   25

#### Using `.loc` (Label-based selection)

In [15]:
# For this to be more powerful, let's set 'Name' as the index
df_indexed = df.set_index('Name')
print("DataFrame with 'Name' as index:")
display(df_indexed)

DataFrame with 'Name' as index:

        Age Gender    Role
Name
Uwaish   22      M   Admin
Husain   23      M  Editor
Khan     24      F  Viewer
Salman   25      M  Editor

In [16]:
# Select the row with the label 'Uwaish'
print("\nSelect row with index label 'Uwaish':")
display(df_indexed.loc[['Uwaish']])

Select row with index label 'Uwaish':

        Age Gender   Role
Name
Uwaish   22      M  Admin

In [17]:
# Select all rows, but only the 'Age' and 'Role' columns
print("\nAll rows, 'Age' and 'Role' columns:")
display(df_indexed.loc[:, ['Age', 'Role']])

All rows, 'Age' and 'Role' columns:

        Age    Role
Name
Uwaish   22   Admin
Husain   23  Editor
Khan     24  Viewer
Salman   25  Editor

### Conditional Selection (Filtering)
This is one of the most common tasks in data analysis.

In [18]:
# Find all people older than 23
print("People older than 23:")
display(df[df['Age'] > 23])

People older than 23:

     Name  Age Gender    Role
2    Khan   24      F  Viewer
3  Salman   25      M  Editor

In [49]:
# Find the names of all 'Editors'
print("\nNames of all Editors:")
display(df.loc[df['Role'] == 'Editor', 'Name'])

Names of all Editors:

1    Husain
3    Salman
Name: Name, dtype: object

## Part 2: Data Inspection and Basic Analysis

Before analyzing data, you must understand its structure. Here are the essential methods.
Let's create a more realistic financial dataset for this part.

In [22]:
fin_data = {
    'Segment': ['Government', 'Midmarket', 'Government', 'Enterprise', 'Small Business', 'Government'],
    'Country': ['Canada', 'France', 'Germany', 'Mexico', 'France', 'Canada'],
    'Product': ['Paseo', 'Velo', 'Paseo', 'VTT', 'Amarilla', 'Paseo'],
    'Units Sold': [1618.5, 2178.0, 1321.0, 888.0, 2475.0, 723.0],
    'Gross Sales': [32370.0, 32670.0, 26420.0, 13320.0, 742500.0, 5061.0],
    'Profit': [16185.0, 10890.0, 13210.0, -4440.0, 12375.0, 686.85],
    'Date': ['2023-01-15', '2023-06-01', '2023-01-15', '2022-11-20', '2023-03-01', '2023-04-01']
}
fin_df = pd.DataFrame(fin_data)

print("Financial Sample DataFrame:")
fin_df

Financial Sample DataFrame:

,Segment,Country,Product,Units Sold,Gross Sales,Profit,Date
0,Government,Canada,Paseo,1618.5,32370.0,16185.00,2023-01-15
1,Midmarket,France,Velo,2178.0,32670.0,10890.00,2023-06-01
2,Government,Germany,Paseo,1321.0,26420.0,13210.00,2023-01-15
3,Enterprise,Mexico,VTT,888.0,13320.0,-4440.00,2022-11-20
4,Small Business,France,Amarilla,2475.0,742500.0,12375.00,2023-03-01
5,Government,Canada,Paseo,723.0,5061.0,686.85,2023-04-01

### Essential Inspection Methods

In [53]:
# Get a concise summary of the DataFrame
print("--- DataFrame Info ---")

fin_df.info()

--- DataFrame Info ---
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Segment      6 non-null      object
 1   Country      6 non-null      object
 2   Product      6 non-null      object
 3   Units Sold   6 non-null      float64
 4   Gross Sales  6 non-null      float64
 5   Profit       6 non-null      float64
 6   Date         6 non-null      datetime64[ns]
 7   Year         6 non-null      int32
 8   Month        6 non-null      int32
 9   Day_Name     6 non-null      object
dtypes: datetime64[ns](1), float64(3), int32(2), object(4)
memory usage: 564.0+ bytes

In [56]:
# View the first 3 rows
print("\n--- First 3 Rows (head) ---")
display(fin_df.head(3))

--- First 3 Rows (head) ---

,Segment,Country,Product,Units Sold,Gross Sales,Profit,Date,Year,Month,Day_Name
0,Government,Canada,Paseo,1618.5,32370.0,16185.0,2023-01-15,2023,1,Sunday
1,Midmarket,France,Velo,2178.0,32670.0,10890.0,2023-06-01,2023,6,Thursday
2,Government,Germany,Paseo,1321.0,26420.0,13210.0,2023-01-15,2023,1,Sunday

In [25]:
# Get statistical summary for numerical columns
print("\n--- Numerical Description ---")
display(fin_df.describe())

--- Numerical Description ---

        Units Sold    Gross Sales        Profit
count     6.000000       6.000000      6.000000
mean   1533.916667  142056.833333   8151.141667
std     696.816074  294360.861848   8120.711177
min     723.000000    5061.000000  -4440.000000
25%     996.250000   16595.000000   3237.637500
50%    1469.750000   29395.000000  11632.500000
75%    2038.125000   32595.000000  13001.250000
max    2475.000000  742500.000000  16185.000000

In [26]:
# Get summary for categorical (object) columns
print("\n--- Categorical Description ---")
display(fin_df.describe(include='object'))

--- Categorical Description ---

           Segment Country Product        Date
count            6       6       6           6
unique           4       4       4           5
top     Government  Canada   Paseo  2023-01-15
freq             3       2       3           2

### Basic Calculations & Sorting

In [27]:
# Calculate total profit
total_profit = fin_df['Profit'].sum()
print(f"Total Profit: ${total_profit:,.2f}")

# Calculate average units sold
avg_units = fin_df['Units Sold'].mean()
print(f"Average Units Sold: {avg_units:.2f}")

Total Profit: $48,906.85
Average Units Sold: 1533.92

In [28]:
# Sort by profit in descending order to see the most profitable entries
print("\nTop 3 Most Profitable Entries:")
display(fin_df.sort_values('Profit', ascending=False).head(3))

Top 3 Most Profitable Entries:

,Segment,Country,Product,Units Sold,Gross Sales,Profit,Date
0,Government,Canada,Paseo,1618.5,32370.0,16185.0,2023-01-15
2,Government,Germany,Paseo,1321.0,26420.0,13210.0,2023-01-15
4,Small Business,France,Amarilla,2475.0,742500.0,12375.0,2023-03-01

## Part 3: Grouping & Aggregating Data

`groupby` is a powerful method that follows the **Split-Apply-Combine** strategy to perform complex analysis.

```mermaid
graph TD
    A[DataFrame] -->|Split by Product| B(Group 1: Paseo)
    A -->|Split by Product| C(Group 2: Velo)
    A -->|Split by Product| D(Group 3: Others)
    B -->|Apply sum to Profit| B1[Sum of Paseo Profits]
    C -->|Apply sum to Profit| C1[Sum of Velo Profits]
    D -->|Apply sum to Profit| D1[Sum of Other Profits]
    B1 --> E{Combine}
    C1 --> E
    D1 --> E
    E --> F[Result: Series of Total Profits by Product]
```

### `.groupby()`
Let's see it in action.

In [29]:
# Group by product and calculate the sum of profits for each
profit_by_product = fin_df.groupby('Product')['Profit'].sum()
print("--- Total Profit by Product ---")
display(profit_by_product)

--- Total Profit by Product ---

Product
Amarilla    12375.00
Paseo       30081.85
VTT         -4440.00
Velo        10890.00
Name: Profit, dtype: float64

In [30]:
# Group by multiple columns: Segment and Country
# Calculate the mean 'Gross Sales' and total 'Units Sold'
agg_funcs = {'Gross Sales': 'mean', 'Units Sold': 'sum'}
multi_group = fin_df.groupby(['Segment', 'Country']).agg(agg_funcs)

print("\n--- Mean Sales and Total Units by Segment and Country ---")
display(multi_group)

--- Mean Sales and Total Units by Segment and Country ---

                        Gross Sales  Units Sold
Segment        Country
Enterprise     Mexico       13320.0       888.0
Government     Canada       18715.5      2341.5
               Germany      26420.0      1321.0
Midmarket      France       32670.0      2178.0
Small Business France      742500.0      2475.0

### Reshaping Data with `.pivot_table()` and `pd.crosstab()`

In [31]:
# Create a pivot table to see total profit for each product across different segments
pivot = fin_df.pivot_table(index='Product', columns='Segment', values='Profit', aggfunc='sum')
print("--- Pivot Table: Total Profit ---")
display(pivot)

--- Pivot Table: Total Profit ---

Segment   Enterprise  Government  Midmarket  Small Business
Product
Amarilla         NaN         NaN        NaN         12375.0
Paseo            NaN    30081.85        NaN             NaN
VTT          -4440.0         NaN        NaN             NaN
Velo             NaN         NaN    10890.0             NaN

In [32]:
# Use crosstab to count the frequency of products in each country
xtab = pd.crosstab(fin_df['Product'], fin_df['Country'])
print("\n--- Crosstab: Product Count by Country ---")
display(xtab)

--- Crosstab: Product Count by Country ---

Country   Canada  France  Germany  Mexico
Product
Amarilla       0       1        0       0
Paseo          2       0        1       0
VTT            0       0        0       1
Velo           0       1        0       0

### Counting Unique Values
The `.value_counts()` method is a handy shortcut for counting occurrences in a single column.

In [33]:
print("Counts of each product sold:")
fin_df['Product'].value_counts()

Counts of each product sold:

Product
Paseo       3
Velo        1
VTT         1
Amarilla    1
Name: count, dtype: int64

## Part 4: Working with Time Series and Strings

Pandas has excellent, built-in capabilities for handling dates and text data using the `.dt` and `.str` accessors.

### Time Series with the `.dt` Accessor

In [34]:
# First, ensure the 'Date' column is in datetime format
print(f"Original 'Date' dtype: {fin_df['Date'].dtype}")
fin_df['Date'] = pd.to_datetime(fin_df['Date'])
print(f"Converted 'Date' dtype: {fin_df['Date'].dtype}")

Original 'Date' dtype: object
Converted 'Date' dtype: datetime64[ns]

In [35]:
# Now we can use the .dt accessor to extract parts of the date
fin_df['Year'] = fin_df['Date'].dt.year
fin_df['Month'] = fin_df['Date'].dt.month
fin_df['Day_Name'] = fin_df['Date'].dt.day_name()

print("\nDataFrame with new date columns:")
display(fin_df[['Date', 'Year', 'Month', 'Day_Name']].head())

DataFrame with new date columns:

        Date  Year  Month   Day_Name
0 2023-01-15  2023      1     Sunday
1 2023-06-01  2023      6   Thursday
2 2023-01-15  2023      1     Sunday
3 2022-11-20  2022     11     Sunday
4 2023-03-01  2023      3  Wednesday

#### Practical Example: Calculating Age

In [39]:
import pandas as pd
import datetime

# Create a DataFrame with birth dates
dob_df = pd.DataFrame({
    'Name': ['Alice', 'Bob', 'Charlie'],
    'DOB_str': ['10-10-1997', '05-12-2002', '01-02-2000']
})

# Convert DOB string to datetime
dob_df['DOB'] = pd.to_datetime(dob_df['DOB_str'], format='%d-%m-%Y')

# Calculate Age
today = pd.to_datetime(datetime.date.today())
dob_df['Age'] = (today - dob_df['DOB']).dt.days // 365

print("Calculated ages:")
print(dob_df)

Calculated ages:
      Name     DOB_str        DOB  Age
0    Alice  10-10-1997 1997-10-10   27
1      Bob  05-12-2002 2002-12-05   22
2  Charlie  01-02-2000 2000-02-01   25

### String Manipulation with the `.str` Accessor

In [59]:
# Let's use our first DataFrame
print("Original 'Role' column:")
display(df[['Role']])

# Convert to lowercase
print("\nLowercase 'Role' column:")
display(df['Role'].str.lower())

Original 'Role' column:

     Role
0   Admin
1  Editor
2  Viewer
3  Editor

Lowercase 'Role' column:

0     admin
1    editor
2    viewer
3    editor
Name: Role, dtype: object

In [38]:
# A powerful use case: splitting a column
email_df = pd.DataFrame({'Email':['Uwaish@deloitte.com', 'Husain@gmail.com', 'Aisha@sdhub.in']})

print("Splitting email into Username and Domain:")
email_df[['Username', 'Domain']] = email_df['Email'].str.split('@', expand=True)
display(email_df)

Splitting email into Username and Domain:

                 Email Username        Domain
0  Uwaish@deloitte.com   Uwaish  deloitte.com
1     Husain@gmail.com   Husain     gmail.com
2       Aisha@sdhub.in    Aisha      sdhub.in

## Conclusion

This notebook has walked you through the essentials of Pandas, from basic data selection to advanced aggregation and manipulation techniques. Key takeaways include:

1.  **Selection is Key**: Use `[]` for simple column selection/row slicing, but prefer `.loc` (label-based) and `.iloc` (integer-based) for precise and unambiguous selections.
2.  **Inspect Your Data**: Always start a project with `.info()`, `.describe()`, and `.head()` to understand the data's structure, types, and content.
3.  **Group and Aggregate**: The `groupby()` method is your primary tool for summarizing data and uncovering patterns.
4.  **Leverage Accessors**: Use the `.dt` accessor for date/time operations and the `.str` accessor for text manipulation to write clean and efficient code.

By mastering these concepts, you have a solid foundation for tackling almost any data analysis task with Pandas.